{
  "title": "Terms and Conditions",
  "effectiveDate": "Effective Date: 30/08/2024",
  "sections": [
    {
      "heading": "Introduction",
      "content": "These Terms and Conditions (\"Terms\") govern your use of Ripple's SaaS platform (\"Service\"). By accessing or using the Service, you agree to be bound by these Terms."
    },
    {
      "heading": "Eligibility",
      "content": "You must be at least 18 years old to use the Service. By using the Service, you represent that you meet this eligibility requirement."
    },
    {
      "heading": "Account Registration",
      "content": "You may be required to create an account to use the Service. You agree to provide accurate and complete information during registration and to keep your account information updated."
    },
    {
      "heading": "Service Use",
      "content": "- License: We grant you a limited, non-exclusive, non-transferable license to use the Service for your personal or business purposes. - Prohibited Activities: You agree not to use the Service for any illegal or unauthorized purpose, and not to interfere with the operation of the Service."
    },
    {
      "heading": "Fees and Payment",
      "content": "If applicable, you agree to pay all fees associated with the use of the Service in accordance with the pricing terms provided at the time of purchase."
    },
    {
      "heading": "Intellectual Property",
      "content": "All content and materials provided by Ripple are protected by intellectual property laws. You may not reproduce, distribute, or create derivative works from any content without our express written consent."
    },
    {
      "heading": "Termination",
      "content": "We may terminate or suspend your access to the Service at any time, without notice, for conduct that we believe violates these Terms or is harmful to our users or us."
    },
    {
      "heading": "Limitation of Liability",
      "content": "Ripple is not liable for any indirect, incidental, or consequential damages arising out of your use of the Service."
    },
    {
      "heading": "Governing Law",
      "content": "These Terms are governed by and construed in accordance with the laws of [Karnataka, India], without regard to its conflict of law principles."
    },
    {
      "heading": "Changes to Terms",
      "content": "We may update these Terms from time to time. You will be notified of any significant changes, and your continued use of the Service constitutes acceptance of the updated Terms."
    },
    {
      "heading": "Contact Us",
      "content": "If you have any questions about these Terms, please contact us at [ceo@goripples.com]."
    }
  ]
}